<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 109.0.1518.49--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">Configurações de substituição do carregador</string><string id="BrowserExecutableFolder">Configurar o local da pasta executável do navegador</string><string id="BrowserExecutableFolder_Explain">Esta política configura aplicativos WebView2 para usar o WebView2 Runtime no caminho especificado. A pasta deve conter os seguintes arquivos: msedgewebview2.exe, msedge.dll e assim por diante.

Para definir o valor do caminho da pasta, forneça um Nome de valor e do Par do valor. Defina o nome do valor como a ID do modelo de usuário do aplicativo ou o nome do arquivo executável. Você pode usar o caractere curinga &quot;*&quot; como nome do valor para aplicar a todos os aplicativos.

Exemplo de valor:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Configurar o local da pasta executável do navegador</string><string id="ReleaseChannelPreference">Definir a preferência de ordem de pesquisa do canal de lançamento</string><string id="ReleaseChannelPreference_Explain">O pedido de pesquisa de canal padrão é WebView2 Runtime, Beta, Dev e Canary.

Para inverter a ordem de pesquisa padrão, defina essa política como 1.

Para definir o valor para a preferência de canal de lançamento, forneça um Nome de valor e Par de valor. Defina o nome do valor como a ID do modelo de usuário do aplicativo ou o nome do arquivo executável. Você pode usar o caractere curinga &quot;*&quot; como nome do valor a ser aplicado a todos os aplicativos.

Exemplo de valor:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Definir a preferência de ordem de pesquisa do canal de lançamento</string><string id="ExperimentationAndConfigurationServiceControl">Controlar a comunicação com o Serviço de Configuração e Experimentação</string><string id="ExperimentationAndConfigurationServiceControl_Explain">O Serviço de Configuração e Experimentação é usado para implantar conteúdos de Configuração e Experimentação para o cliente.

O conteúdo de experimentação consiste em uma lista de recursos iniciais de desenvolvimento que a Microsoft está habilitando para testes e comentários.

O conteúdo de configuração consiste em uma lista de configurações recomendadas que a Microsoft deseja implantar para otimizar a experiência do usuário.

O conteúdo da configuração também pode conter uma lista de ações a serem executadas em determinados domínios por razões de compatibilidade. Por exemplo, o navegador pode substituir a cadeia de caracteres de Agente de Usuário em um site se esse site estiver quebrado. Cada uma dessas ações deve ser temporária enquanto a Microsoft tenta resolver o problema com o proprietário do site.

Se você definir essa política como 'FullMode', o conteúdo total será baixado do Serviço de Configuração e Experimentação. Isso inclui os conteúdos de Configuração e Experimentação.

Se você definir esta política como 'ConfigurationsOnlyMode', somente o conteúdo de configuração será baixado.

Se você definir essa política como 'RestrictedMode', a comunicação com o Serviço de Configuração e Experimentação será interrompido completamente. A Microsoft não recomenda essa configuração.

Se você não configurar essa política em um dispositivo gerenciado, o comportamento nos canais Beta e Estável será o mesmo que no 'ConfigurationsOnlyMode'. Nos canais Canary e Dev, o comportamento é o mesmo que no 'FullMode'.

Se você não configurar essa política em um dispositivo não gerenciado, o comportamento será o mesmo que no 'FullMode'.

Mapeamento das opções da política:

* FullMode (2) = Recuperar configurações e experimentos

* ConfigurationsOnlyMode (1) = Recuperar apenas configurações

* RestrictedMode (0) = Desabilitar a comunicação com o Serviço de Configuração e Experimentação

Use as informações anteriores ao configurar essa política.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Recuperar configurações e experimentos</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Recuperar apenas configurações</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Desabilitar a comunicação com o Serviço de Configuração e Experimentação</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge versão 97, Windows 7 ou posterior</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge versão 87, Windows 7 ou posterior</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Configurações Padrão (os usuários podem substituir)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Defina o nome do valor para a ID do modelo de usuário do aplicativo ou o nome do arquivo executável. Você pode usar o caractere curinga &quot;*&quot; como nome do valor para aplicar a todos os aplicativos.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Defina o nome do valor para a ID do modelo de usuário do aplicativo ou o nome do arquivo executável. Você pode usar o caractere curinga &quot;*&quot; como nome do valor para aplicar a todos os aplicativos.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Controlar a comunicação com o Serviço de Configuração e Experimentação</dropdownList></presentation></presentationTable></resources></policyDefinitionResources>